### Задача № 1. 
### За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров? 
### При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
### Input: n =700; m = 750. Output: 2.

### Решение
n = int(input('n--> '))
# m = 750
# print(750/700)
print(n, type(n))